20240110080116-periods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Periods</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Periods</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdaa221d">1. Periods</a>
<ul>
<li><a href="#org2a3f818">1.1. Using Periods</a>
<ul>
<li><a href="#orgeb51ca5">1.1.1. <span class="underline">Exam Trick</span></a></li>
<li><a href="#org299184e">1.1.2. Format</a></li>
<li><a href="#orgceaa7d2">1.1.3. Example</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdaa221d" class="outline-2">
<h2 id="orgdaa221d"><span class="section-number-2">1.</span> Periods</h2>
<div class="outline-text-2" id="text-1">
<p>
A ZooKeeper has decided to switch out the animal's toys every three months
</p>

<div class="org-src-container">
<pre class="src src-java">public static void main(String[] args) {
    var start = LocalDate.of(2022, Month.JANUARY, 1);
    var end = LocalDate.of(2022, Month.MARCH, 30);
    performAnimalEnrichment(start, end);
}
private static void performAnimalEnrichment(LocalDate start, LocalDate end) {
    var upTo = start;
    while (upTo.isBefore(end)) { // check if still before end
        System.out.println("give new toy: " + upTo);
        upTo = upTo.plusMonths(1); // add a month
    }
}
</pre>
</div>
</div>

<div id="outline-container-org2a3f818" class="outline-3">
<h3 id="org2a3f818"><span class="section-number-3">1.1.</span> Using Periods</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java">public static void main(String[] args) {
    var start = LocalDate.of(2022, Month.JANUARY, 1);
    var end = LocalDate.of(2022, Month.MARCH, 30);
    var monthly = Period.ofMonths(1); // create a period
    performAnimalEnrichment(start, end, monthly);
}

private static void performAnimalEnrichment(LocalDate start, LocalDate end, Period period) { // uses the generic period
    var upTo = start;
    while (upTo.isBefore(end)) {
        System.out.println("give new toy: " + upTo);
        upTo = upTo.plus(period); // adds the period
    }
}
</pre>
</div>

<p>
The <code>method</code> can add an arbitrary period of <code>time</code> that is passed in.
</p>

<p>
This allows us to <b>reuse</b> the same method for <b>different periods</b> of time as our zookeeper changes their mind.
</p>

<p>
There are <code>five</code> ways to create a <code>Period</code> class:
</p>

<div class="org-src-container">
<pre class="src src-java">var annually = Period.ofYears(1);  // every 1 year
var quarterly = Period.ofMonths(3); // every 3 months
var everyThreeWeeks = Period.ofWeeks(3); // every 3 weeks
var everyOtherDay = Period.ofDays(2); // every 2 days
var everyYearAndAWeek = Period.of(1, 0, 7); // every year and 7 days
</pre>
</div>
</div>

<div id="outline-container-orgeb51ca5" class="outline-4">
<h4 id="orgeb51ca5"><span class="section-number-4">1.1.1.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
There’s one catch.
You <b>cannot</b> chain methods when creating a Period.
Only the <b>last method</b> is used because the <code>Period.of</code> methods are <code>static</code> methods:
</p>
</div>

<ol class="org-ol">
<li><a id="org09cf04d"></a>Example<br />
<div class="outline-text-5" id="text-1-1-1-1">
<div class="org-src-container">
<pre class="src src-java">var wrong = Period.ofYears(1).ofWeeks(1); // every week (Instead of everyYearAndWeek)
</pre>
</div>

<p>
This tricky code is really like writing the following:
</p>

<div class="org-src-container">
<pre class="src src-java">var wrong = Period.ofYears(1);
wrong = Period.ofWeeks(1);
</pre>
</div>

<p>
That’s why the <code>of()</code> method allows you to pass in the number of <code>years</code>, <code>months</code>, and <code>days</code>.
They are all included in the <b>same period</b>. (You will get a compiler warning about this.)
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org299184e" class="outline-4">
<h4 id="org299184e"><span class="section-number-4">1.1.2.</span> Format</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-java">System.out.println(Period.of(1,2,3)); // P1Y2M3D
System.out.println(Period.ofMonths(3)); // P3M
</pre>
</div>

<p>
As you can see, the <code>P</code> always starts out the <code>String</code> to show it is a <b>period measure</b>.
Then come the <b>number</b> of <code>years</code>, <b>number</b> of <code>months</code>, and <b>number</b> of <code>days</code>.
</p>

<p>
If any of these are zero, they are omitted.
</p>
</div>
</div>

<div id="outline-container-orgceaa7d2" class="outline-4">
<h4 id="orgceaa7d2"><span class="section-number-4">1.1.3.</span> Example</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-java">var date = LocalDate.of(2022, 1, 20);
var dateTime = LocalDateTime.of(date, time);
var period = Period.ofMonths(1);

System.out.println(date.plus(period)); // 2022–02–20
System.out.println(dateTime.plus(period)); // 2022–02–20T06:15
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java">var time = LocalTime.of(6, 15);
var period = Period.ofMonths(1);

System.out.println(time.plus(period)); // Exception
</pre>
</div>

<p>
This won’t work. Java throws an <code>UnsupportedTemporalTypeException</code> and complains that we attempted to use an Unsupported unit: <code>Months</code>.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
